def count_vowels():
    #введення тексту користувачем.
    текст = input("Введіть текст: ")
    
    #переведення тексту у нижній регістр.
    текст_нижній = текст.lower()
    
    #визначення множини голосних.
    голосні = {'a', 'e', 'i', 'o', 'u', 'y'}
    
    #підрахунок голосних у тексті.
    кількість_голосних = sum(1 for символ in текст_нижній if символ in голосні)
    
    #виведення результату.
    print("Кількість голосних літер:", кількість_голосних)

#виклик функції.
count_vowels()
